<?php include 'includes/wrapper/wr_header.php'; ?>

	<br/><h1>Welcome to our eshop!</h1>
	<table width="600px" height="380px" style="margin-top:10px;" background="images/book.png" cellspacing="45"><tr><td align="center">
		<p>Το κατάστημα θα πρέπει να έχει οργανωμένα τα προϊόντα που πουλάει σε κατηγορίες. Επιλέγοντας από το βασικό
		μενού κάποια κατηγορία, ο χρήστης θα μπορεί να βλέπει λίστα των προϊόντων αυτής της κατηγορίας. Θα πρέπει να
		γίνεται σελιδοποίηση της λίστας προϊόντων, ώστε να μην εμφανίζονται πάνω από Χ (π.χ. 5) προϊόντα ανά σελίδα. Ο
		χρήστης θα μπορεί να φιλτράρει τη λίστα προϊόντων βάσει επιθυμητών ή ανεπιθύμητων τιμών των
		χαρακτηριστικών τους (π.χ. ανάλυση φωτογραφικής μηχανής κινητού, συχνότητα επεξεργαστή υπολογιστή, κ.α.).
		Παρόμοια λειτουργία φιλτραρίσματος μπορείτε να δείτε σε καταστήματα όπως www.plaisio.gr και
		www.multirama.gr. Ο χρήστης θα πρέπει να μπορεί να τοποθετεί και να αφαιρεί προϊόντα στο καλάθι αγορών του
		και να το επισκέπτεται όποτε επιθυμεί. Δεν χρειάζεται να υλοποιήσετε τη διαδικασία ολοκλήρωσης μιας αγοράς
		προϊόντων. Ο χρήστης θα πρέπει να μπορεί να γίνεται μέλος του καταστήματος ανοίγοντας λογαριασμό και
		δίνοντας κάποια προσωπικά του στοιχεία. Κάνοντας κλικ σε κάποιο προϊόν μιας λίστας προϊόντων, ο χρήστης θα
		πηγαίνει σε σελίδα με περισσότερες πληροφορίες για το προϊόν.
		</p>
	</td></tr></table>		
	
	<?php products(); ?>

<?php include 'includes/wrapper/wr_footer.php'; ?>
